HELLO_MESSAGE = 'Привет, я бот для определения общего времени для группы людей.'

HELP_MESSAGE =  ("Я помогу вам организовать встречу с вашими друзьями, "
                 "коллегами или знакомыми, находя удобное общее время для всех участников. "
                 "Вы можете присоединиться к существующей группе, используя ссылку-приглашение, "
                 "или создать новую и пригласить других. После того как участники присоединятся, "
                 "я помогу вам найти время, которое подходит всем, для организации встречи.")

ERROR_MESSAGE = "Произошла техническая неполадка, попробуйте ещё раз"

TEAM_NAME_MESSAGE = "Напишите название группы, которую вы хотите создать"